{"conjugations": {"conditional": ["bateria", "baterias", "bateria", "bateríamos", "bateríeis", "bateriam"], "gerund": ["batendo"], "imperative": {"affirmative": ["-", "bate", "bata", "batamos", "batei", "batam"], "negative": ["-", "batas", "bata", "batamos", "batais", "batam"]}, "indicative": {"future": ["baterei", "baterás", "baterá", "bateremos", "batereis", "baterão"], "imperfect": ["batia", "batias", "batia", "batíamos", "batíeis", "batiam"], "pluperfect": ["batera", "bateras", "batera", "batêramos", "batêreis", "bateram"], "present": ["bato", "bates", "bate", "batemos", "bateis", "batem"], "preterite": ["bati", "bateste", "bateu", "batemos", "batestes", "bateram"]}, "infinitive": {"impersonal": ["bater"], "personal": ["bater", "bateres", "bater", "batermos", "baterdes", "baterem"]}, "pastparticiple": {"feminine]": ["batida", "batidas"], "masculine": ["batido", "batidos"]}, "subjunctive": {"imperfect": ["batesse", "batesses", "batesse", "batêssemos", "batêsseis", "batessem"], "present": ["bata", "batas", "bata", "batamos", "batais", "batam"], "preterite": ["bater", "bateres", "bater", "batermos", "baterdes", "baterem"]}}, "definitions": ["(transitive with em) to beat; to beat up (to attack someone violently)\n\n\nO valentão gosta de bater nos colegas mais fracos.\n\nThe bully likes to beat his weaker classmates up.", "(intransitive or transitive with em or contra or a reciprocal pronoun) to hit; to strike (to collide with violently)\n\n\nO pássaro bateu no vidro e morreu.\n\nThe bird hit the glass and died.\n\n\n\n\nAs pedras de gelo batiam contra o telhado.\n\nThe hailstones were striking the roof.\n\n\n\n\nOs aviões se bateram no ar.\n\nThe aeroplanes collided in mid-air.\n\n\n\n\nOs aviões bateram no ar.\n\nThe aeroplanes collided in mid-air.", "(transitive) to crash (to cause something to collide)\n\n\nLiguei para a emergência porque bati o carro.\n\nI called emergency because I crashed the car.", "(transitive) to clap (to repeatedly strike two objects, especially the hands)\n\n\nNão creio que a audiência baterá as palmas.\n\nI don’t think the audience will clap their hands.", "(transitive with em or a) to knock on (to hit an object rhythmically in order to get someone’s attention)\n\n\nBati na janela do meu amigo para ele acordar.\n\nI knocked on my friend’s window so he would wake up.", "(music, transitive with em or with no preposition) to beat (to play a percussion instrument)\n\n\nEu bato tambor em todos os eventos do nosso clube.\n\nI play the drum at all our club’s events.", "(transitive) to close something (such as a door or drawer) violently\n\n\nEla ficou brava, correu para o seu quarto e bateu a porta.\n\nShe got angry, ran to her room and smashed the door.", "(Brazil, transitive) to snap (to create a photograph)\n\n\nPedi a um turista para bater uma foto de nós.\n\nI asked a tourist to snap a photo of us.", "(chiefly military, transitive) to scout (to explore a wide terrain)\n\n\nO general mandou os cavaleiros baterem o terreno à frente para evitar uma emboscada.\n\nThe general ordered the horsemen to scout the region ahead in order to prevent an ambush.", "(cooking, transitive) to whisk; to whip; to beat (to mix in a rapid aerating fashion)\n\n\nBata uns ovos para fazer omelete.\n\nWhisk some eggs to make omelette.", "(transitive) to flail an object, such as a rug or piece of clothing, in order to remove dust or water from it\n\n\nO tapete estava tão empoeirado que quando o batemos levantou uma nuvem de poeira.\n\nThe rug was so dusty that when we flailed it a cloud of dust appeared.", "(Brazil, informal, impersonal, transitive) to get a feeling, especially one that is not very strong\n\n\nCorri uns dez quilómetros antes de bater um cansaço.\n\nI ran for ten kilometres before I got a little tired.", "(transitive with para) to rush to (to go somewhere very fast)\n\n\nSe começar a chover, bate para dentro de casa.\n\nIf it starts to rain, rush into the house.", "(transitive with em) to shine on (of a light); to be cast over (of a shadow)\n\n\nA sombra do balão bate bem na gente.\n\nThe balloon cast its shadow right over us.\n\n\n\n\nO sol bate nessa parede durante a tarde.\n\nThe sunlight shines on this wall during the afternoon.", "(intransitive) of the heart: to beat; to pulsate\n\n\nMeu coração batia a mil.\n\nMy heart was beating really fast.", "(transitive) to beat; to flutter; to flap (to move one’s wings)\n\n\nBeija-flores batem suas asas muito rápido.\n\nHummingbirds beat their wings very fast.", "(transitive) to beat; to defeat\n\n\nNosso time consegue bater o teu.\n\nOur team can beat yours.", "(transitive) to beat (to achieve a better value than)\n\n\nNinguém conseguiu bater o record.\n\nNo one was able to beat the record.", "(transitive with em) to reach a value\n\n\nO preço da maçã está batendo nos cinquenta centavos.\n\nThe price of the apple is reaching fifty cents.\n\n\n\n\nDurante a enchente, a água bateu na nossa cintura.\n\nDuring the flood, the water reached our waists.", "(takes a reflexive pronoun, intransitive, or transitive with em) to struggle (with) (to have difficulty in doing something)\n\n\nEu me bati por algumas horas na tarefa de matemática antes de desistir.\n\nI struggled with the maths homework for a few hours before I gave up.", "(intransitive, or transitive with com) to match (to be equal or corresponding)\n\n\nOs nosso resultados não batem com os deles.\n\nOur results don’t match theirs.", "(association football, transitive) to perform a game-restarting kick (such as a penalty kick or free kick)\n\n\nNenhum dos jogadores quis se arriscar a bater o pênalti.\n\nNone of our players wanted to perform the penalty kick.", "(Brazil, slang, transitive) to pick; to pickpocket (to steal something by sleight of hand)\n\n\nUns pivetes batiam carteiras na praia.\n\nSome urchins were picking wallets at the beach.", "(transitive with em) of a special occasion: to occur in a given date\n\n\nEsse ano o natal baterá num sábado.\n\nThis year Christmas will be on a Saturday.", "(combat sports, intransitive) to tap out (to punch or tap the floor, indicating submission)\n\n\nO boxeador bateu no segundo round.\n\nThe boxes tapped out on the second round.", "(transitive) to lock a padlock\n\n\nBata o cadeado do portão antes de sair.\n\nPadlock the gate before you leave."], "description": "bater (first-person singular present indicative bato, past participle batido)", "etymology": "From Old Portuguese bater, from Late Latin battere, variant of Latin battuere, present active infinitive of battuō, from Gaulish.", "page_id": 1781634, "pronunciations": ["(Portugal) IPA(key): /bɐ.ˈteɾ/"], "related": [], "synonyms": ["(to beat up): arrebentar", "(to collide with): colidir", "(to play a percussion instrument): batucar", "percutir", "(to snap a photograph): tirar", "fazer", "(to scout): explorar", "(to rush to): correr para/até", "(to shine or be cast on): incidir em/sobre", "(to pulsate): pulsar", "(to defeat): derrotar", "acabar com", "(to achieve a better value than): superar", "(to reach a value): alcançar", "(to struggle): debater-se", "(to match): conferir (com)", "(to occur in a given date): cair em"], "url": "https://en.wiktionary.org/?curid=1781634#Portuguese", "word": "bater"}